IDEA StatiCa Open Model
TimePoint.LastConstructionStage Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Last construction stage - Time of the start of cyclic loading for fatigue check
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool LastConstructionStage { get; set; }
Public Property LastConstructionStage As Boolean
	Get
	Set
public:
property bool LastConstructionStage {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
TimePoint Class
IdeaRS.OpenModel.Concrete Namespace